04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/verticalChannel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 100000;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }

    front
    {
        type            symmetryPlane;
    }

    inletCentral
    {
        type            fixedFluxPressure;
    }

    inletSides
    {
        type            fixedFluxPressure;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 100000;
    }

    walls
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
